In [2]:
import pandas as pd

In [4]:
import numpy as np

In [9]:
df= pd.DataFrame(np.random.randn(4,3), index = ['a','b', 'c', 'd'], columns = ['x','y','z'])
print(df)

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351

In [10]:
df > 1

       x      y      z
a  False  False  False
b  False  False  False
c  False   True  False
d  False  False  False

In [12]:
# 불리언 메트릭스를 df에 또 넣으면 그부분만 마스킹이된다.
df[df >1]

    x         y   z
a NaN       NaN NaN
b NaN       NaN NaN
c NaN  3.057358 NaN
d NaN       NaN NaN

In [15]:
df[df['x'] > 0]

          x         y         z
b  0.619551 -1.011813  0.102221
d  0.943168 -0.680893 -0.429351

In [19]:
df[df['x'] > 0]['z']

b    0.102221
d   -0.429351
Name: z, dtype: float64

In [21]:
df

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351

In [22]:
df[(df['x'] > 0) | (df['y'] > 0)]

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351